# Pandas 라이브러리 import
* pandas는 외부 패키지이지만 아나콘다에 기본적으로 설치되어 제공되기 때문에 별도 설치할 필요가 없다.
* pandas는 관용적으로 pd라는 별칭을 사용한다.

In [1]:
import pandas as pd

# 데이터프레임 만들기
* 데이터프레임 : 엑셀의 시트(sheet)와 동일한 개념이다. (2차원 표 형태)

## 리스트로 만들기
* pd.DataFrame(2차원리스트, columns=컬럼리스트, index=인덱스리스트)
* 행 단위로 데이터프레임이 생성된다.
* 컬럼, 인덱스를 지정하지 않으면 디폴트로 0부터 시작하는 숫자가 지정된다.

In [3]:
df = pd.DataFrame(
    [['james', 30, 'programmer'],
    ['amy', 20, 'student'],
    ['david', 25, 'designer']],
    columns = ['name', 'age', 'job'],
    index = ['a', 'b', 'c'])

df

    name  age         job
a  james   30  programmer
b    amy   20     student
c  david   25    designer

## 딕셔너리로 만들기
* pd.DataFrame(딕셔너리, index=인덱스리스트)
* 딕셔너리는 {컬럼명1:컬럼값리스트, 컬럼명2:컬럼값리스트...}
* 컬럼 단위로 데이터프레임이 생성된다.
* 딕셔너리의 키가 컬럼명이 된다.
* 인덱스를 지정하지 않으면 디폴트로 0부터 시작하는 숫자가 지정된다.

In [4]:
{'name':['james','amy','david'],
 'age':[30,20,25],
 'job':['programmer','student','designer']
}

df = pd.DataFrame({'name':['james', 'amy', 'david'],
                  'age':[30,20,25],
                  'job':['programmer','student','designer']},
                 index = ['a','b','c'])

df

    name  age         job
a  james   30  programmer
b    amy   20     student
c  david   25    designer

## csv 파일에서 데이터를 읽어와 만들기
* pd.read_csv(파일경로)
* csv파일은 utf-8 형식이어야 한다.

In [10]:
df = pd.read_csv('C:/Users/jjunghu/Desktop/jjunghu/data/scores.csv')
df

        name    kor    eng   math
0      Aiden  100.0   90.0   95.0
1    Charles   90.0   80.0   75.0
2     Danial   85.0  100.0  100.0
3       Evan  100.0  100.0  100.0
4      Henry    NaN   35.0   60.0
5        Ian   90.0  100.0   90.0
6      James   70.0   75.0   65.0
7     Julian   80.0   90.0   55.0
8     Justin   50.0   60.0  100.0
9      Kevin  100.0  100.0   90.0
10       Leo   90.0   95.0   70.0
11    Oliver   70.0   75.0   65.0
12     Peter  100.0   95.0  100.0
13       Amy   90.0   75.0   90.0
14     Chloe   95.0  100.0   95.0
15     Danna  100.0  100.0  100.0
16     Ellen    NaN   60.0    NaN
17      Emma   70.0   65.0   70.0
18  Jennifer   80.0   55.0   80.0
19      Kate   50.0    NaN   50.0
20     Linda  100.0   90.0  100.0
21    Olivia   90.0   70.0   90.0
22      Rose   70.0   65.0   70.0
23     Sofia  100.0  100.0  100.0
24   Tiffany   90.0    NaN   90.0
25   Vanessa   95.0   70.0   95.0
26   Viviana  100.0   80.0  100.0
27    Vikkie    NaN   50.0  100.0
28    Winnie   70.0  100.0   70.0
29      Zuly   80.0   90.0   95.0

# 데이터 미리보기

## 가장 앞의 n행 보기
* 데이터프레임.head(n)
* 시리즈.head(n)
* n을 생략하면 5개의 행을 출력한다

In [11]:
df.head(3)

      name    kor    eng   math
0    Aiden  100.0   90.0   95.0
1  Charles   90.0   80.0   75.0
2   Danial   85.0  100.0  100.0

In [12]:
df.head()

      name    kor    eng   math
0    Aiden  100.0   90.0   95.0
1  Charles   90.0   80.0   75.0
2   Danial   85.0  100.0  100.0
3     Evan  100.0  100.0  100.0
4    Henry    NaN   35.0   60.0

## 가장 뒤의 n행 보기
* 데이터프레임.tail(n)
* n을 생략하면 5개의 행을 출력한다

In [14]:
df.tail(3)

      name   kor    eng   math
27  Vikkie   NaN   50.0  100.0
28  Winnie  70.0  100.0   70.0
29    Zuly  80.0   90.0   95.0

In [15]:
df.tail()

       name    kor    eng   math
25  Vanessa   95.0   70.0   95.0
26  Viviana  100.0   80.0  100.0
27   Vikkie    NaN   50.0  100.0
28   Winnie   70.0  100.0   70.0
29     Zuly   80.0   90.0   95.0

## 랜덤 보기

### 랜덤 n개 데이터 보기
* 데이터프레임.sample(n)
* n을 생략하면 1개의 샘플을 출력한다.

In [16]:
df.sample()

     name   kor   eng   math
8  Justin  50.0  60.0  100.0

In [17]:
df.sample(5)

       name    kor    eng   math
1   Charles   90.0   80.0   75.0
3      Evan  100.0  100.0  100.0
7    Julian   80.0   90.0   55.0
9     Kevin  100.0  100.0   90.0
11   Oliver   70.0   75.0   65.0

### 랜덤 샘플 비율로 보기
* 데이터프레임.sample(frac=0.2)
* 지정한 비율의 샘플을 출력한다

In [18]:
df.sample(frac=0.2)   # frac=0.2 -> 20%만 추출

     name    kor    eng   math
13    Amy   90.0   75.0   90.0
23  Sofia  100.0  100.0  100.0
14  Chloe   95.0  100.0   95.0
19   Kate   50.0    NaN   50.0
0   Aiden  100.0   90.0   95.0
16  Ellen    NaN   60.0    NaN

## 높은 순/낮은순 보기

### 높은순 보기
* 데이터프레임.nlargest(갯수,컬럼명)
* 컬럼의 데이터가 숫자형일 때 사용할 수 있다.

In [19]:
# eng 높은 순으로 5개 보기

df.nlargest(5, 'eng')

      name    kor    eng   math
2   Danial   85.0  100.0  100.0
3     Evan  100.0  100.0  100.0
5      Ian   90.0  100.0   90.0
9    Kevin  100.0  100.0   90.0
14   Chloe   95.0  100.0   95.0

### 낮은순 보기
* 데이터프레임.nsmallest(갯수,컬럼명)
* 컬럼의 데이터가 숫자형일 때 사용할 수 있다.

In [20]:
# eng 낮은 순으로 5개 보기

df.nsmallest(5, 'eng')

        name   kor   eng   math
4      Henry   NaN  35.0   60.0
27    Vikkie   NaN  50.0  100.0
18  Jennifer  80.0  55.0   80.0
8     Justin  50.0  60.0  100.0
16     Ellen   NaN  60.0    NaN

# 데이터 요약 보기

## (행,열)의 크기 보기
* 데이터프레임.shape

In [21]:
df.shape

(30, 4)

## 데이터의 갯수 보기
* len(데이터프레임)

In [22]:
len(df)

30

## 컬럼명 보기
* 데이터프레임.columns
* 데이터프레임의 열 이름을 확인한다.

In [23]:
df.columns

Index(['name', 'kor', 'eng', 'math'], dtype='object')

## 인덱스 보기
* 데이터프레임.index
* 데이터프레임의 인덱스를 확인한다.

In [24]:
df.index

RangeIndex(start=0, stop=30, step=1)

In [25]:
df

        name    kor    eng   math
0      Aiden  100.0   90.0   95.0
1    Charles   90.0   80.0   75.0
2     Danial   85.0  100.0  100.0
3       Evan  100.0  100.0  100.0
4      Henry    NaN   35.0   60.0
5        Ian   90.0  100.0   90.0
6      James   70.0   75.0   65.0
7     Julian   80.0   90.0   55.0
8     Justin   50.0   60.0  100.0
9      Kevin  100.0  100.0   90.0
10       Leo   90.0   95.0   70.0
11    Oliver   70.0   75.0   65.0
12     Peter  100.0   95.0  100.0
13       Amy   90.0   75.0   90.0
14     Chloe   95.0  100.0   95.0
15     Danna  100.0  100.0  100.0
16     Ellen    NaN   60.0    NaN
17      Emma   70.0   65.0   70.0
18  Jennifer   80.0   55.0   80.0
19      Kate   50.0    NaN   50.0
20     Linda  100.0   90.0  100.0
21    Olivia   90.0   70.0   90.0
22      Rose   70.0   65.0   70.0
23     Sofia  100.0  100.0  100.0
24   Tiffany   90.0    NaN   90.0
25   Vanessa   95.0   70.0   95.0
26   Viviana  100.0   80.0  100.0
27    Vikkie    NaN   50.0  100.0
28    Winnie   70.0  100.0   70.0
29      Zuly   80.0   90.0   95.0

## 데이터의 자료형 보기
* 데이터프레임.dtypes
* 데이터프레임을 구성하는 값의 자료형을 확인한다.
* 판다스에서는 문자열의 데이터타입이 object이다.

In [26]:
df.dtypes

name     object
kor     float64
eng     float64
math    float64
dtype: object

## 데이터프레임 정보 보기
* 데이터프레임.info()
* 데이터프레임의 총 샘플 갯수, 컬럼 수, 컬럼 별 정보 등을 확인한다.

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    30 non-null     object
 1   kor     27 non-null     float64
 2   eng     28 non-null     float64
 3   math    29 non-null     float64
dtypes: float64(3), object(1)
memory usage: 1.1+ KB

## 컬럼의 유니크한 데이터 뽑기
* 컬럼.unique()

In [28]:
df['kor'].unique()

array([100.,  90.,  85.,  nan,  70.,  80.,  50.,  95.])

## 컬럼의 유니크한 값의 갯수 보기
* 컬럼.**value_counts()**

In [29]:
df['kor'].value_counts()

100.0    8
90.0     6
70.0     5
80.0     3
50.0     2
95.0     2
85.0     1
Name: kor, dtype: int64

## 요약통계 보기

In [30]:
df.describe()

             kor         eng        math
count   27.00000   28.000000   29.000000
mean    85.37037   80.892857   84.827586
std     14.93099   18.361270   15.950972
min     50.00000   35.000000   50.000000
25%     75.00000   68.750000   70.000000
50%     90.00000   85.000000   90.000000
75%    100.00000  100.000000  100.000000
max    100.00000  100.000000  100.000000

In [31]:
df['kor'].mean()

85.37037037037037

# 시리즈 만들기
* pd.Series(리스트)
*시리즈 : 엑셀시트의 열 1개를 의미한다.(1차원 리스트형태)

In [34]:
# 시리즈 만들기

s1 = pd.Series(['amy',170,240])
print(s1)
print()
print(s1.index)

0    amy
1    170
2    240
dtype: object

RangeIndex(start=0, stop=3, step=1)

In [35]:
# 타입 확인하기
type(s1)

pandas.core.series.Series

# 시리즈의 index와 value 가져오기
* 시리즈에는 index와 value가 있다.
* 시리즈의 index 가져오기 : **시리즈.index**
* 시리즈의 value 가져오기 : **시리즈.values**
* 시리즈의 인덱스는 리스트의 인덱스와 다른 개념이다.       
시리즈의 인덱스는 데이터의 이름이고, 행번호는 따로 있다.

In [36]:
# 시리즈 인덱스 가져오기
s1.index

RangeIndex(start=0, stop=3, step=1)

In [37]:
# 시리즈 데이터 가져오기
s1.values

array(['amy', 170, 240], dtype=object)

# 시리즈의 index 지정하기
* 시리즈.index = 인덱스리스트
* 시리즈의 인덱는 숫자, 문자열 모두 가능하다.

In [39]:
# 시리즈 인덱스 지정하기

s1.index = ['name', 'height', 'footsize']
print(s1)

name        amy
height      170
footsize    240
dtype: object

In [40]:
# 인덱스 확인하기

s1.index

Index(['name', 'height', 'footsize'], dtype='object')

In [42]:
# 데이터 확인하기

s1.values

array(['amy', 170, 240], dtype=object)

# 시리즈의 통계값 사용하기
* 평균 : 시리즈.mean()
* 최소값 : 시리즈.min()
* 최대값 : 시리즈.max()
* 중간값 : 시리즈.median()
* 표준편차 : 시리즈.std()
* 시리즈의 통계값은 시리즈의 value가 모두 숫자형일 때 사용할 수 있다.

In [43]:
s2 = pd.Series([10, 20, 30, 40, 50])
s2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [44]:
print('평균: ', s2.mean())
print('최솟값: ', s2.min())
print('최댓값: ', s2.max())
print('중간값: ', s2.median())
print('표준편차: ', s2.std())

평균:  30.0
최솟값:  10
최댓값:  50
중간값:  30.0
표준편차:  15.811388300841896

* 요약통계 : 시리즈.describe()

In [45]:
s2.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

# 시리즈 주요 메서드
* 값 정렬 : 시리즈.**sort_values( )**
* 인덱스 정렬 : 시리즈.**sort_index( )**
* 인덱스 리셋 : 시리즈.**reset_index( )**  --> 행번호로 인덱스 재지정
* 특정 값을 가진 시리즈 값을 교체 : **replace(찾을값, 교체할값)**
* 시리즈를 데이터프레임으로 변환 : **시리즈.to_frame( )**

In [46]:
s3 = pd.Series([1, 3, 2, 4, 10])
s3

0     1
1     3
2     2
3     4
4    10
dtype: int64

In [48]:
# s3의 value 중 10을 5로 교체

s3 = s3.replace(10, 5)
s3

0    1
1    3
2    2
3    4
4    5
dtype: int64

In [49]:
# s3 정렬 (디폴트는 오름차순 : ascending=True)

s3.sort_values()

0    1
2    2
1    3
3    4
4    5
dtype: int64

In [50]:
s3.sort_values(ascending = False)

4    5
3    4
1    3
2    2
0    1
dtype: int64

In [51]:
# s3을 데이터프레임으로 만들기

s3.to_frame()

   0
0  1
1  3
2  2
3  4
4  5

In [52]:
s1

name        amy
height      170
footsize    240
dtype: object

In [53]:
# 시리즈 인덱스 새로 만들기

s1.reset_index()

      index    0
0      name  amy
1    height  170
2  footsize  240